<template>
    <div class="flex flex-center">
        <div class="div1">
            <h5>
                О приложении:
            </h5>
            <p>
                Всем привет! Данное приложение призвано централизовать информацию о пользователях популярной платформы VK , вся информация о пользователях их увлечениях , 
                техническое состоянии их аккаунта раскидана по всей площадке , данное же приложение скомпанует все в одно место , даже позволит увидеть некоторые 
                поля которые не доступны при обычном просмотре страницы.Приложение находится на стадии разработки.
                
            </p>
            <h5>
                Функционал:
            </h5>
            <p>
                Чтобы найти нужного вам человека необходимо ввести в поиск его Имя и Фамилию , после чего вам будет выдан список пользователей <br>
                чтобы увидеть подробную информацию нажмите "Показать" , вам будет показано модальное окно в котором будут указаны следующие параметры: <br>
                <ul>
                    <li>Онлайн</li>
                    <li>Статус</li>
                    <li>Кол-во подписчиков</li>
                    <li>Уведомления</li>
                    <li>Телефон</li>
                </ul>
                !!! Строка "Уведомления" показывает то , будет ли отправлено уведомление пользователю о заявке в друзьях или сообщении от неизвестного пользователя <br>
                !!! Максимальное число выдоваемых пользователей - 300
            </p>
        </div>
    </div>
</template>

<script>
import { defineComponent } from 'vue'
export default defineComponent({})
</script>

<style scoped>
    .div1 {
        width: 30%;
    }
    @media  screen and (width < 1400px) {
        .div1 {
            width: 70%;
        }
    }
</style>